kms254/Mustang-Dash-Test/boards/variants/H755ZI_Q_MULE/variant_NUCLEO_H743ZI.h
#ifdef ARDUINO_NUCLEO_H743ZI2
  #define NUM_DIGITAL_PINS      119
#else
  #define NUM_DIGITAL_PINS      117
#endif
#define NUM_DUALPAD_PINS        2
#define NUM_ANALOG_INPUTS       28

// On-board LED pin number
#ifndef LED_BUILTIN
  #define LED_BUILTIN           PB0  // LD1
#endif
#define LED_GREEN               LED_BUILTIN
#ifdef ARDUINO_NUCLEO_H743ZI2
  #define LED_YELLOW            PE1  // LD2
#else
  #define LED_BLUE              PB7  // LD2
#endif
#define LED_RED                 PB14 // LD3

// On-board user button
#ifndef USER_BTN
  #define USER_BTN              PC13
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
  #define TIMER_TONE            TIM6
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO           TIM7
#endif

// UART Definitions
#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  3 //Connected to ST-Link
#endif

// Serial pin used for console (ex: ST-Link)
// Required by Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         PD9
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         PD8
#endif

// HSE default value is 25MHz in HAL
// HSE_BYPASS is 8MHz
// Repo-local change (2026-08-19, Board3 first power-on): the stock define is
// UNGUARDED against the command line, so `-D HSE_VALUE=25000000UL` in the
// board3 env was silently stomped back to 8000000 in every TU including this
// header -- which (a) made the sketch's `HSE_VALUE == 25000000UL` gate false,
// compiling OUT the Board3 clock override so the stock 8 MHz ST-LINK-MCO
// BYPASS config ran against a real crystal (HSERDY never sets, hang in
// HAL_RCC_OscConfig), and (b) would skew SystemCoreClock math 3.125x even if
// it booted. #ifndef lets the env's value win; envs that don't set it (the
// mule on a real Nucleo with the 8 MHz MCO) keep the stock default.
#if !defined(HSE_VALUE) && !defined(HSE_BYPASS_NOT_USED)
  #define HSE_VALUE             8000000
#endif

// Extra HAL modules
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
#if !defined(HAL_ETH_MODULE_DISABLED)
  #define HAL_ETH_MODULE_ENABLED
#endif
#if !defined(HAL_QSPI_MODULE_DISABLED)
  #define HAL_QSPI_MODULE_ENABLED
#endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif

/* Repo-local variant copy for the NUCLEO-H755ZI-Q mule (board3_mule env).
 * The -Q board wires VCORE DIRECT-SMPS. The stock USE_PWR_LDO_SUPPLY is
 * consumed by ExitRun0Mode(), which runs from the startup file BEFORE main()
 * and before the sketch's SystemClock_Config override -- and the H7 supply
 * config is WRITE-ONCE until the next power-on reset, so the first post-POR
 * boot latches LDO and hangs forever at the ACTVOSRDY wait (2-instruction
 * spin, empty stack, looks bricked; warm reset does NOT clear it, only POR).
 * Warm-reset boots inherit whatever the last POR latched, which is how this
 * survived every bench boot until the first real power cycle (2026-08-12).
 * USE_PWR_DIRECT_SMPS_SUPPLY compiles ExitRun0Mode to a no-op under the H743
 * headers (no SMPS macro), leaving the sketch's SystemClock_Config to make
 * the first -- correct, direct-SMPS -- supply write after POR.
 *
 * Board3 (real H755, LDO-wired VCORE) needs the SAME no-op, found live at
 * first power-on (2026-08-19): the stock USE_PWR_LDO_SUPPLY branch compiled
 * under H743 headers is `PWR->CR3 |= LDOEN` -- an OR that cannot clear the
 * H755's SMPSEN (bit 2; named SCUEN in H743 headers). The H755 POR default
 * (CR3=0x46) keeps "SMPS feeds LDO" selected, Board3 floats VLXSMPS/VFBSMPS,
 * so ACTVOSRDY never sets and the chip spins pre-main -- confirmed over SWD
 * (PC pinned in ExitRun0Mode, CR3 0x46, CSR1 ACTVOSRDY=0). The define below
 * does NOT configure direct SMPS for Board3; under these headers its only
 * effect is the ExitRun0Mode no-op. The sketch's Board3 SystemClock_Config
 * then makes the first supply write: LDO-only, raw bits. */
#if defined(DASH_MULE_H755Q) || defined(DASH_BOARD_BOARD3)
  #define USE_PWR_DIRECT_SMPS_SUPPLY
#else
  #define USE_PWR_LDO_SUPPLY
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #define SERIAL_PORT_MONITOR     Serial
  #define SERIAL_PORT_HARDWARE    Serial
#endif
